{
  "officers": [
    {
      "role": "President",
      "name": "Allison Alder",
      "year": "3rd",
      "coops": "Intuit",
      "major": "Computer Science",
      "whycs": "In high school I took part in Technovation Challenge, a program that introduces high school girls to computer science and entrepreneurship. From there I interned at Kapor Capital and met women in the field who inspired me to pursue Computer Science as a major.",
      "favclass": "Networks and Distributed Systems. Really interesting material, I learned a lot about how the internet works, and Professor Mislove was awesome.",
      "hobbies": "Eating food, League of Legends, and playing with SFX make-up"
    },
    {
      "role": "Vice President",
      "name": "Teresa Krause",
      "year": "3rd",
      "coops": "Hubspot",
      "major": "Computer Science",
      "whycs": "I started programming my TI-84 in middle school as a way of killing time in math class (oops). In high school I used/ adapted scripts to process data for the astronomy research I was doing at UCSC and realized that the programming was my favorite part. I transitioned from a more mechanical role to a programming role on my school’s FIRST robotics team, and loved it. I was then delighted to find that there were not only majors, but also careers centered around programming and creating software.",
      "favclass": "Fundies 1 with Professor Felleisen. I learned so much over the semester about not only programming but thinking. It reshaped the way I go about problem solving and made me feel ready to take on any problem systematically.",
      "hobbies": "Sleeping, organizing hackathons, baking, and petting dogs."
    },
    {
      "role": "Treasurer",
      "name": "Shivanjali Singh",
      "year": "4th",
      "coops": "Goldman Sachs, Intuit",
      "major": "Computer Science and Business Administration (Finance and Accounting concentrations)",
      "whycs": "I was exposed to computer science by my father who is a software developer, but I had zero experience with coding when I first started out at Northeastern. After Fundies 1, I realized that this major challenged me in the best way and I found that exhilarating! I chose to make CS my major because of the way it makes you think so logically but allows you to be creative at the same time. The idea of dissecting human logic into factions that can be fed into a computer to emulate that human logic is mind-blowing to me, I just want to learn more and more!",
      "favclass": "Object Oriented Design (OOD) - I was able to apply CS principles at a higher level and delve deeper into coding topics",
      "hobbies": "Walking around Boston, being an avid foodie, Netflix"
    },
    {
      "role": "Co-Outreach",
      "name": "Jacqueline Ali",
      "year": "Prisoner of Azkaban",
      "coops": "Galatea Associates",
      "major": "Computer Science",
      "whycs": "When I was in fifth grade, I finished the PS2 game Sly Cooper and the Thievius Raccoonus and unlocked a 'making of the game' video. That was when I first considered game programming as a job. I no longer want to develop games, but it was definitely the reason I got into tech. Now, I'm motivated by the freedom computer science gives you to create real-world change.",
      "favclass": "Object-Oriented Design. Dr. Tov revamped the course, so I learned a ton of useful things right before going on co-op. The assignments were fun to complete. And thank the gods: he had us using IntelliJ. Down with Eclipse!",
      "hobbies": "Travel, visit new restaurants, watch The Legend of Korra, go on adventures, workout"
    },
    {
      "role": "Co-Outreach",
      "name": "Yifan Xing",
      "year": "2nd",
      "major": "Computer Science and Business Administration",
      "whycs": "When I came to Northeastern, I was in Economics department and I had very little coding experience with HTML in high school. In the second semester of my first year, I had an option to select an elective course. Two of my friends were taking CS2500, Fundamental of Computer Science, and they strongly suggested me to take the course with them. With excitement and anxiety, I chose to take the course. While struggling with learning how to code, I enjoyed the process of creating and designing programs on my own, which are opportunities that have never appeared to me before. I was extremely enthusiastic about the new challenge and was ready to accept the challenge. Therefore, I transferred to CCIS department and started my coding adventure.",
      "favclass": "Fundamental of Computer Science (CS2500) – This course introduced me to computer science. I learned how to code and also found my passion.",
      "hobbies": "Chatting with families and friends, attending fun activities, watching movies and listening to music."
    },
    {
      "role": "Public Relations",
      "name": "Emily Montgomery",
      "year": "5th",
      "coops": "West Texas IT Consulting, State Street Global Advisors",
      "major": "Information Science",
      "whycs": "I've always enjoyed messing around with computers and finding and creating new solutions to problems. I chose IS because I really enjoy the human aspect of courses like HCI and Software Project Management.",
      "favclass": "HCI - we studied all sorts of technologies and how people interact with them and how to create accessible and intuitive designs. It made me rethink the way I design things so that people can use them to their full potential.",
      "hobbies": "Netflixing and cooking."
    }
  ]
}